handouts/syllabus/syllabus_econometrics_2017.tex
% Created 2017-02-12 Sun 22:40
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{setspace}
\singlespace
\usepackage{CJK}
\usepackage{parskip}
\hypersetup{colorlinks,citecolor=black,filecolor=black,linkcolor=black,urlcolor=black}
\setcounter{secnumdepth}{1}
\author{Zheng Tian}
\date{Spring semester, 2017}
\title{Syllabus for Introduction to Econometrics}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Syllabus for Introduction to Econometrics},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Basic information}
\label{sec:org1406c79}

\subsection*{Time and location}
\label{sec:org401e86e}

\begin{center}
\begin{tabular}{llll}
Odd weeks & Monday & 08:00 am -- 09:50 am & Buoxue Building (\begin{CJK}{UTF8}{gbsn}博学楼\end{CJK}) 706\\
 & Wednesday & 10:00 am -- 11:50 am & Buoxue Building (\begin{CJK}{UTF8}{gbsn}博学楼\end{CJK}) 306\\
Even weeks & Monday & 08:00 am -- 11:50 am & Buoxue Building (\begin{CJK}{UTF8}{gbsn}博学楼\end{CJK}) 706\\
\end{tabular}
\end{center}


\subsection*{Instructor information}
\label{sec:org2977feb}

\begin{center}
\begin{tabular}{ll}
Name: & Zheng Tian (\begin{CJK*}{UTF8}{gbsn}田峥\end{CJK*})\\
Email: & ztian\_cueb@163.com\\
Office: & Angong Building (\begin{CJK*}{UTF8}{gbsn}安工楼\end{CJK*}) 215\\
Tel: & 8395-1054\\
\end{tabular}
\end{center}


\subsection*{Office hours}
\label{sec:org0ce8e48}
Office hours are tentatively scheduled as follows,

\begin{center}
\begin{tabular}{ll}
Tuesday & 9:30 am -- 11:30 am\\
Friday & 9:30 am -- 11:30 am\\
\end{tabular}
\end{center}

You are welcomed to stop by my office at any other time. But making
an appointment by email or phone in advance is highly recommended.


\section{Course description}
\label{sec:orgee45d21}

\subsection*{Objectives}
\label{sec:org645e350}

Econometrics is a subject in Economics, consisting of "economic
tricks" for quantitative analysis. It is an indispensable component in
economists' toolbox. The roles of Econometrics include, but not
limited to, quantitatively examining the association between economic
variables, giving empirical support to economic theories, making
forecasts about economic performance in the future, and evaluating
policy impacts. At an introductory level, this course want to
achieve the following goals: (1) letting students know basic
econometric theories and methods, (2) enabling students to use
software, primarily R, to estimate a simple econometric model, and (3)
making students be aware of the notion of reproducible research as a
standard workflow of empirical research.

Serving for these ends, the contents of this course will cover single
and multiple linear regression model, the ordinary least squares
estimation, hypothesis testing, model specification assessment,
detection and solutions to problems in regression, such as,
heteroskedasticity and multicollinearity, and panel data model. If
time is permitted, we will also cover such topics as instrumental
variable methods, and the Probit and Logit models. This course will
not cover Time Series Econometrics except for a touch on the
concept of serial correlation. This course will lay out a solid
foundation for the future series of Econometric courses, such as
Intermediate Econometrics, Time Series Econometrics, and Advanced
Econometrics.


\subsection*{Prerequisite}
\label{sec:orgac07e4c}

Principles of Microeconomics, Principles of Macroeconomics, Calculus,
Introductory Probability and Statistics, and Linear Algebra.


\section{Textbooks}
\label{sec:org5438746}
\subsection*{Required}
\label{sec:orgc0e76df}

Stock, J. and Wastson, M. (2010) \emph{Introduction to Econometrics}, 3rd
edition

\subsection*{Recommended}
\label{sec:org91c8052}

\begin{itemize}
\item Jeffery Wooldridge (2012) \emph{Introductory Econometrics}, 5th edition, China edition

\item Kleiber and Zeileis (2008) \emph{Applied Econometrics with R}
\end{itemize}


\section{Course materials}
\label{sec:org5a7cdfb}
\subsection*{Lecture notes}
\label{sec:orge91895c}

Lecture notes, along with other course materials, including slides,
homework, and answers, will be uploaded to
\url{https://isem-cueb-ztian.github.io/Intro-Econometrics-2017/}. 

\subsection*{Book companion materials}
\label{sec:org8f85f84}

There is a companion website for this book,
\url{http://wps.aw.com/aw\_stock\_ie\_3/}, where you can download dataset for
exercises, pratical quizzes, and STATA tutorial. 

\section{Course assignments}
\label{sec:orgd3958ce}
\subsection*{Homework}
\label{sec:org22e4ae0}

\begin{itemize}
\item Homework will be assigned every other week, aiming to help students
understand fundamental concepts in econometric theories and grasp
basic estimation and inference methods.

\item Each homework will consist of two parts, theoretical questions and
empirical exercises, which are all selected from the end-of-chapter
exercises in the textbook of Stock and Watson.

\item The due day of each homework will be on Mondays of the week after
each homework is assigned. I strongly suggest you do your homework
early before the due day.

\item You can finish your homework by either handwriting or typesetting
using word process software, e.g., Microsoft Word, \LaTeX{}, and the
like. Typesetting rather than handwriting is highly recommended.

\item Homework will be graded as A, B, C, and D, based on the following
rule
\begin{itemize}
\item \textbf{A}: Homework is submitted by the due day. Numeric and mathematical
answers are correct for all questions with only minor
mistakes. Empirical exercises are finished with the desired
format (the format is explained below). Explanations to your
answers are convincing with correct use of econometric
terminology. English writing is clear and grammatically right. (A
= 100 percent points)
\item \textbf{B}: Homework is submitted by the due day. Numeric and
mathematical answers are correct for most questions. Empirical
exercises are finished with the desired format. Explanations are
sound but may not be totally right. English writing is good with
minor grammatical errors. (B = 85 percent points)
\item \textbf{C}: Homework is submitted by the due day. Empirical exercises
are finished, without complying with the required format. Numeric
and mathematical answers are correct for nearly half of
questions. Explanations may not be right but with some
merits. English writing is merely understandable with obvious
grammatical errors. (C = 70 percent points)
\item \textbf{D}: Homework is submitted by the due day. Numeric and
mathematical answers are correct only for a few
questions. Explanations are wrong. English writing is very
poor. (D = 60 percent points)
\end{itemize}

\item Homework must be submitted on the due day. A grace period for late
submission can be granted by request in advance. If granted, you
must turn in your homework within one week after the due day. Late
submission of homework is subject to reducing score to a lower
level. No submission at all will result in no score on homework.
\end{itemize}

\begin{itemize}
\item Requirement for empirical exercises
\label{sec:orgae0338a}

Empirical exercises are the questions that ask you to do data analysis
with software. Completing empirical exercises usually involves two
types of work. One type is writing code in software to read data,
estimate the model, and calculate statistics. Another type of work is
writing narrative words to describe your question and explaining your
results. Therefore, completed empirical exercises should reflect
your endeavor on both types of work. To this end, the desired format
of empirical exercises should consist of the following components.

\begin{enumerate}
\item A short introduction to what is the question;
\item Mathematical equations for the regression model and statistics;
\item A description of your estimation results with correct
interpretation;
\item Tables and graphs that help reflect estimation results;
\item The code that you write to carry out estimation.
\end{enumerate}

Although you can use any software to do empirical exercises, I prefer
using RStudio and the \texttt{rmarkdown} package, which I will teach in
class. We will learn how to make dynamic documents in the manner of
reproducible research.

\item The requirements for group working on homework
\label{sec:orge4be63d}

Admittedly, some questions in homework may be difficult and completing
a whole set of homework may be time consuming. Therefore, I allow you
to form study groups to do homework. Sharing knowledge and helping
fellow students are meritorious, and the spirit of team working is
desirable in many careers.

The formation of study groups is totally voluntary. The size of each
group should not exceed four students, and each student should only
join one group. Please send me the information of your study group no
later than \textbf{March 6th}.

High resemblance of completed homework within each group is
permitted. However, homework that is highly alike between groups will
be treated as shirking, resulting in lower scores for all persons
involved. Similarly, empirical exercises can only be identical among
members within each group, and should be different between groups.
\end{itemize}


\subsection*{Mid-term examination}
\label{sec:org81a2e34}

\begin{itemize}
\item The mid-term exam will cover most materials taught before and
including Chapter 6: multiple regression estimation.
\item It is tentatively scheduled on \textbf{April 24th, Monday}.
\item It will be a closed-book test. But you are allowed to bring a
one-sided "cheat sheet", on which you can write down some notes that
help you remember some important definitions and formulae. You are
allowed to write on only one side on the cheat sheet.
\item If you miss the mid-term exam, a make-up test can be arranged. You
must notify me of your absence in advance with a valid excuse.
\end{itemize}


\subsection*{Final examination}
\label{sec:org7fbae0e}

\begin{itemize}
\item The final exam will be comprehensive, covering all being taught
throughout the semester.
\item The time and location are to be arranged and announced by the
university.
\item It will also be a closed-book test. You are still allowed to
bring a "cheat sheet" written on \textbf{both sides} this time.
\item The make-up test will follow the rule of the university.
\end{itemize}


\section{Grade distribution}
\label{sec:org0c6e3b1}

\begin{center}
\begin{tabular}{lr}
Assignments & Scores\\
\hline
Homework & 30\\
Midterm exam & 30\\
Final exam & 40\\
\hline
total & 100\\
\end{tabular}
\end{center}


\section{Course outline and schedule}
\label{sec:orgddab947}

Table \ref{tab:org1f50891} displays the tentative outline and schedule
for this course. The schedule is subject to change according to
the actual course progress. Chapters referred in the table are in the
required textbook. Other related references would be cited in lecture
notes.

{\small
\begin{longtable}{p{2.8cm}p{9cm}p{3cm}}
\caption{\label{tab:org1f50891}
Tentative Course Schedule}
\\
 &  & \\
Dates & Contents & Due dates\\
\hline
\endfirsthead
\multicolumn{3}{l}{Continued from previous page} \\

Dates & Contents & Due dates \\

\hline
\endhead
\hline\multicolumn{3}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\hline
Week 1 &  & \\
\textit{[2017-02-20 Mon]} & Syllabus and Introduction (Chapter 1) & \\
\textit{[2017-02-22 Wed]} & Review of probability (Chapter 2) & \\
\hline
Week 2 &  & \\
\textit{[2017-02-27 Mon]} & Review of statistics (Chapter 3) & \\
\hline
Week 3 &  & \\
\textit{[2017-03-06 Mon]} & Review of linear algebra (Appendix 18.1) & Homework 1 due\\
\textit{[2017-03-08 Wed]} & Introduction to R & \\
\hline
Week 4 &  & \\
\textit{[2017-03-13 Mon]} & Single regression: estimation (Chapters 4 and 17) & \\
\hline
Week 5 &  & \\
\textit{[2017-03-20 Mon]} & Continue on single regression estimation & \\
\textit{[2017-03-22 Wed]} & Single regression: hypothesis tests (chapters 5 and 17) & \\
\hline
Week 6 &  & \\
\textit{[2017-04-03 Mon]} & Continue on single regression hypothesis tests & Homework 2 due\\
\hline
Week 7 &  & \\
\textit{[2017-04-10 Mon]} & Single regression with R and introduction to rmarkdown & \\
\textit{[2017-04-12 Wed]} & Multiple regression: estimation (chapters 6 and 18) & \\
\hline
Week 8 &  & \\
\textit{[2017-04-17 Mon]} & Continue on multiple regression estimation & Homework 3 due\\
\hline
Week 9 &  & \\
\textit{[2017-04-24 Mon]} & Mid-term examination & \\
\textit{[2017-04-26 Wed]} & Multiple regression: hypothesis tests (chapters 7 and 18) & \\
\hline
Week 10 &  & \\
\textit{[2017-05-01 Mon]} & Labor Day break & Homework 4 due\\
\hline
Week 11 &  & \\
\textit{[2017-05-08 Mon]} & Continue on multiple regression hypothesis tests & \\
\textit{[2017-05-10 Wed]} & Multiple regression with R & \\
\hline
Week 12 &  & \\
\textit{[2017-05-15 Mon]} & Nonlinear regressions (chapter 8) & Homework 5 due\\
\hline
Week 13 &  & \\
\textit{[2017-05-22 Mon]} & Continue on nonlinear regressions and R & \\
\textit{[2017-05-24 Wed]} & Assessing multiple regression (chapter 9) & \\
\hline
Week 14 &  & \\
\textit{[2017-05-29 Mon]} & Continue on assessing multiple regression & Homework 6 due\\
\hline
Week 15 &  & \\
\textit{[2017-06-05 Mon]} & Regression with panel data (chapter 10) & \\
\textit{[2017-06-07 Wed]} & Continue on panel data model and R & \\
\hline
Week 16 &  & \\
\textit{[2017-06-12 Mon]} & Review and Q\&A & Homework 7 due\\
\hline
Week 17 &  & \\
TBA & Final examination & \\
\hline
\end{longtable}
}


\section{Policy on academic dishonesty}
\label{sec:org6377a05}

Academic dishonesty is defined to include but is not limited to the
following: plagiarism; cheating and dishonest practices in connection
with examinations, papers and projects; forgery, misrepresentation and
fraud. Such behavior will not be tolerated and will be handled
according to university guidelines.
\end{document}